Autodesk.Revit.DB.Events.PostEventArgs.Status
Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an APIevent handler).

Autodesk.Revit.DB.Events.PostEventArgs
The class is used as a base class for arguments of any post-event.